In [6]:
import pandas as pd
df_titanic = pd.read_csv("./Titanic_Dataset.csv")
df_titanic.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

In [7]:
df_titanic.drop(["name", "embarked", "body" ,"ticket", "cabin"], axis=1).head()
# df_titanic.columns

,pclass,survived,sex,age,sibsp,parch,fare,boat,home.dest
0,1,1,female,29.00,0,0,211.3375,2,"St Louis, MO"
1,1,1,male,0.92,1,2,151.5500,11,"Montreal, PQ / Chesterville, ON"
2,1,0,female,2.00,1,2,151.5500,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,male,30.00,1,2,151.5500,NaN,"Montreal, PQ / Chesterville, ON"
4,1,0,female,25.00,1,2,151.5500,NaN,"Montreal, PQ / Chesterville, ON"

In [17]:
df_titanic[["sex", "age"]].head()

      sex    age
0  female  29.00
1    male   0.92
2  female   2.00
3    male  30.00
4  female  25.00

In [9]:
df_titanic.loc[[3,4,8], ["sex", "age"]]

      sex   age
3    male  30.0
4  female  25.0
8  female  53.0

In [10]:
df_titanic.iloc[5, 8]

np.float64(26.55)

In [11]:
df_titanic.loc[5, "sex"]

'male'

In [12]:
df_titanic[df_titanic['age']>75]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
14,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.00,A23,S,B,NaN,"Hessle, Yorks"
61,1,1,"Cavendish, Mrs. Tyrell William (Julia Florence...",female,76.0,1,0,19877,78.85,C46,S,6,NaN,"Little Onn Hall, Staffs"

In [19]:
df_titanic["pclass"]

0       1
1       1
2       1
3       1
4       1
       ..
1304    3
1305    3
1306    3
1307    3
1308    3
Name: pclass, Length: 1309, dtype: int64